
#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

from django.urls import path
from . import views

#==========================================================================================#
# >>>>>  ЛОКАЛЬНЫЕ ССЫЛКИ ДЛЯ РАБОТЫ САЙТА <<<<< #
#==========================================================================================#

# Связываем путь к странице и наполнение  страницы.
urlpatterns = [
    path('', views.main_page, name="MainPage")
]
